{
    "projects": [
    {
        "Image": "/images/seabed.jpg",
        "Name": "Procedural Seabed",
        "Description": "A procedurally generated underwater environment made for the course Procedural Methods for Images at Linköping University. The project let me improve my shader knowledge and learn how to create interesting shaders using Unity Shader Graph. It also let me understand how to work with procedurally generated meshes and procedurally placed game objects, both at start- and runtime.",
        "Type": "Unity, Unity Shader Graph, C#.",
        "Link": "https://github.com/Linnet5/Underwater"
    },
    {
        "Image": "/images/cloth.jpg",
        "Name": "Cloth Physics Simulation",
        "Description": "Simulation of a piece of cloth that was visualized in a 3D environment using OpenGL. The cloth uses interactive properties to change how the cloth behaves, and the simulation is based on the mass spring model. The project was developed in the course ''Modelling Project'' at Linköping University.",
        "Type": "C++, OpenGL, MATLAB",
        "Link": "https://github.com/davidstyrbjorn/TNM085-cloth-simulation"
    },
    {
        "Image": "/images/raytrace.jpg",
        "Name": "Monte Carlo Raytracer",
        "Description": "This software is able to render images of 3D scenes in which light reflects between surfaces. It can handle spherical objects, as well as objects built out of triangular polygons. The software can also handle different surface materials that reflect the light differently. Monte Carlo ray tracing techniques are used to handle global illumination calculations.",
        "Type": "C++, GLM.",
        "Link": "https://github.com/Linnet5/Global-Illumination-Tracer"
    },
    {
        "Image": "/images/clicker.jpg",
        "Name": "Lobbyist Clicker 3D",
        "Description": "Lobbyist Clicker is a clicker game centered around gathering currency in the form of lobbyists. Lobbyists can be generated by clicking a production building or by spending lobbyists to buy passive generation.",
        "Type": "Unity, Blender, C#.",
        "Link": "https://robotgandhi.itch.io/lobbyist-clicker-3d"
    },
    {
        "Image": "/images/wire.jpg",
        "Name": "Down to the Wire",
        "Description": "Down to the Wire was an entry for the gamejam LudumDare 50. The game is a puzzle game where you race against the clock to disarm an explosive, gaining some more time for each stage solved. The game received very positive feedback and landed on overall 70th place, and with its highest rating in the ''Fun'' category, where it placed 59th.",
        "Type": "Unity, C#, Figma Cubase, FL-Studio.",
        "Link": "https://ldjam.com/events/ludum-dare/50/down-to-the-wire"
    },   
    {"Image": "/images/trainer.jpg",
        "Name": "VT - Bachelor Project",
        "Description": "We created a mobile game called Virtual Trainer which was developed for Android devices. The game used motion controls through the use of the built in gyro and accelerometer sensors that exist in modern phones. The project was under development for six months and during the development we used the agile development process Scrum.",
        "Type": "Unity, C#, Aseprite",
        "Link": "https://github.com/Linnet5/Kandidatprojekt"}
    ]
}